{
    "projects": [
        {
            "projectName": "Mandelbrot Set",
            "description": "The <span class='important'>Mandelbrot Set</span> is fractal created by Benoit Mandelbrot. I wrote this project in <span class='important'>C++</span> and made use of <span class='important'>SFML</span> to generate the video screen that portrays the Mandelbrot set. Over quarantine I began reading up on <span class='important'>fractals</span> after seeing several images online and wanted to practice my coding skills as well. The Mandelbrot set is the most interesting fractal to me, however I do plan to create others in my spare time.",
            "links": [
                "media/projects/Mandelbrot_Set.mp4"
            ],
            "thumbNail": "media/projects/Mandelbrot_Set.png"
        },
        {
            "projectName": "FPS: Finite Platform Shooter",
            "description": "<span class='important'>FPS: Finite Platform Shooter</span> is a first person platformer. This game was a team effort between my friend and I. It was made over a 48 hour period during <span class='important'>HeroJam 2017</span>. It is written in C# and built in Unity.",
            "links": [
                "media/projects/FPS_HeroJam2017.PNG",
                "media/projects/FPS_Finite_Platformer_Shooter.mp4"
            ],
            "thumbNail": "media/projects/FPS_HeroJam2017.PNG"
        },
        {
            "projectName": "Trealthy",
            "description": "<span class='important'>Trealthy</span> is a first person stealth adventure. The player is tasked with find all of the pieces of the Empress tarot card, which symbolizes fertility and new growth, in order to fight back against the dark forces of pollution. The enemies are clouds of toxic pollution hunting the player through a forest. This game makes use of an AI system for the enemies, shaders, and custom models. It was made over a 48 hour period during <span class='important'>Roc GameJam 2019</span>. It was scripted in C# with shaders being written in HLSL, it was built in Unity.",
            "links": [
                "media/projects/Trealthy_GameJam2019.PNG",
                "media/projects/Trealthy.mp4"
            ],
            "thumbNail": "media/projects/Trealthy_GameJam2019.PNG"
        },
        {
            "projectName": "What Lies Beneath",
            "description": "<span class='important'>What Lies Beneath</span> is a geo-location, augmented reality, mobile application designed for Android devices. It was the result of a semester long research studio while studying abroad in Dubrovnik, Croatia, which hosts one of <span class='important'>RIT's</span> satelite campuses. The goal of the app was to attempt to alleviate the problem of massive crowds of tourists clogging the streets of the historic Old Town in an interesting and engaging way. The app featured multiple quests, designed and built around the Croatian and Dubrovnik history and folklore. It was written in C# and built in Unity. World localization and representation was accomplished using the <span class='important'>Mapbox API</span> while a Unity plug-in, <span class='important'>Vuforia</span>, was used to build the AR functionality.",
            "links": [
                "media/projects/What_Lies_Beneath_Overview.PNG",
                "media/projects/What_Lies_Beneath_AR_Screen_Demo.mp4",
                "media/projects/What_Lies_Beneath_Reboot_Video_V2.mp4"
            ],
            "thumbNail": "media/projects/What_Lies_Beneath_Logo.PNG"
            
        }
    ],
    "repeatedClasses": [
        "fade",
        "numbertext",
        "modal-content",
        "caption",
        "prev",
        "next",
        "close",
        "videoControls",
        "playPause",
        "progressBar",
        "mute",
        "volumeSlider",
        "fullScreen",
        "mySlides"
    ],
    "repeatedTextValues": [
        "&#10094;",
        "&#10095;",
        "&times;"
    ],
    "repeatedIntValues": [
        -1,
        1
    ],
    "aboutMe": [
        "<p>My name is Nick Marano. I am a <span class='important'>Web Developer</span> and <span class='important'>Game Designer</span> graduate of <span class='important'>Rochester Institute of Technology</span>. I come from outside of <span class='important'>Philadelphia, PA</span>. I have worked on several different projects for a couple different companies/ organizations and really enjoy working in a professional setting of web design. I like to spend my free time playing games, solo or multi, and working on side projects and/or 3D models. Before going away to college, I would volunteer time at and enter cacti into the <span class='important'>Philadelphia Flower Show.</span></p>"
    ],
    "bodyIds": [
        "navbar",
        "grid"
    ],
    "navbarLinks": [
        "links",
        "home",
        "work",
        "about",
        "contact"
    ]
}